controllers/BuscaImovelController.php

    public function actionBuscarCodigo($codigo)
    {

    	$imovel = Imovel::find()->where("codigo = '".strtoupper($codigo)."'")->one();
---
SELECT * FROM `imovel` WHERE codigo = 'COD123'