controllers/ImovelController.php

    public function actionCreate()
    {
        $model = new Imovel();
        $caractImovel = new CaracteristicasImovel();

        if ($model->load(Yii::$app->request->post()) && $model->validate())
        {
            $caracteristicas = Yii::$app->request->post('CaracteristicasImovel');

            $model->codigo = strtoupper(Yii::$app->request->post('Imovel')['codigo']);
            if($model->save(false))
            {
                if(!empty($caracteristicas))
                {
                    foreach($caracteristicas as $value)
                    {
                        $caractImovel = new CaracteristicasImovel();

                        $caractImovel->imovel = $model->id;
                        $caractImovel->caracteristica = $value;

                        $caractImovel->save(false);
                    }
                }
            }
            return $this->redirect(['view', 'id' => $model->id]);
        }
        else
        {
            $tipoImovel = ArrayHelper::map(TipoImovel::find()->orderBy('nome')->all(), 'id', 'nome');
            $cidades = ArrayHelper::map(Cidade::find()->orderBy('nome')->all(), 'codigo', 'nome');
            $caracteristicas = ArrayHelper::map(Caracteristicas::find()->all(), 'id', 'nome');
---
SELECT * FROM `tipo_imovel` ORDER BY `nome`
SELECT * FROM `cidade` ORDER BY `nome`
SELECT * FROM `caracteristicas`

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        print_r(ArrayHelper::map($model->caracteristicasImovel, 'caracteristica', 'caracteristica'));

        if ($model->load(Yii::$app->request->post()) && $model->save())
        {
            //Caracteristicas salvas
            $savedCaract = ArrayHelper::map($model->caracteristicasImovel, 'caracteristica', 'caracteristica');
---
UPDATE `imovel` SET `tipo`=4, `bairro`=3788, `situacao`=1, `valor`=150000, `condominio`=100, `iptu`=0, `area_util`=55, `area_lote`=NULL, `area_const`=NULL, `banheiros`=1, `suites`=NULL, `quartos`=2, `salas`=1, `vagas`=1, `varandas`=NULL WHERE `id`=5
SELECT * FROM `caracteristicas`
SELECT * FROM `caracteristicas_imovel` WHERE `imovel`=5

        else
        {

            $tipoImovel = ArrayHelper::map(TipoImovel::find()->orderBy('nome')->all(), 'id', 'nome');
            $cidades = ArrayHelper::map(Cidade::find()->orderBy('nome')->all(), 'codigo', 'nome');
            $caracteristicas = ArrayHelper::map(Caracteristicas::find()->all(), 'id', 'nome');
---
SELECT * FROM `tipo_imovel` ORDER BY `nome`
SELECT * FROM `caracteristicas`


            $cidade = $model->bairro0->cidade0->codigo;

            $cidades = ArrayHelper::map(Cidade::find()->all(), 'codigo', 'nome');

            $bairros = ArrayHelper::map(Bairro::find()->where("cidade = $cidade")->all(), 'codigo', 'nome');

            $caractSelected = ArrayHelper::map(CaracteristicasImovel::find()->where("imovel = $model->id")->all(), 'caracteristica', 'caracteristica');
---
SELECT * FROM `cidade` ORDER BY `nome`
SELECT * FROM `bairro` WHERE `codigo`=3788
SELECT * FROM `cidade` WHERE `codigo`=2980
SELECT * FROM `caracteristicas_imovel` WHERE imovel = 4
SELECT * FROM `imovel` WHERE `id`='3'

    protected function findModel($id)
    {
        if (($model = Imovel::findOne($id)) !== null) {
---
SELECT * FROM `imovel` WHERE `id`='5'