controllers/ImovelController.php

SELECT * FROM `tipo_imovel` ORDER BY `nome`
SELECT * FROM `cidade` ORDER BY `nome`
---
    public function actionCreate()
    {
        $model = new Imovel();
        $caractImovel = new CaracteristicasImovel();

        if ($model->load(Yii::$app->request->post()) && $model->validate())
        {
            $caracteristicas = Yii::$app->request->post('CaracteristicasImovel')['caracteristica'];
            $model->codigo = strtoupper(Yii::$app->request->post('Imovel')['codigo']);

            if($model->save(false))
            {
                if(!empty($caracteristicas))
                {
                    foreach($caracteristicas as $value)
                    {
                        $caractImovel = new CaracteristicasImovel();

                        $caractImovel->imovel = $model->id;
                        $caractImovel->caracteristica = $value;

                        $caractImovel->save(false);
                    }
                }
            }
            return $this->redirect(['view', 'id' => $model->id]);
        }
        else
        {
            $tipoImovel = ArrayHelper::map(TipoImovel::find()->orderBy('nome')->all(), 'id', 'nome');
            $cidades = ArrayHelper::map(Cidade::find()->orderBy('nome')->all(), 'codigo', 'nome');

SELECT * FROM `caracteristicas_imovel` WHERE imovel = 3
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save())
        {
            //Caracteristicas salvas
            $savedCaract = ArrayHelper::map($model->caracteristicasImovel, 'caracteristica', 'caracteristica');