components/BuscaWidget.php

SELECT * FROM `tipo_imovel`
SELECT * FROM `cidade`
---
    public function run()
    {
        $tipoImovel = ArrayHelper::map(TipoImovel::find()->all(), 'id', 'nome');
        $cidades = ArrayHelper::map(Cidade::find()->all(), 'codigo', 'nome');