models/ImovelSearch.php

    public function imoveisDestaque()
    {
        $query = Imovel::find();

        $dataProvider = new ActiveDataProvider([
            'query' => $query,
            'pagination' => [
                'pageSize' => 4,
                'totalCount' => $query->count()
            ]
---
SELECT COUNT(*) FROM `imovel`